package days02;

/**
 * @author SIEUN
 *@date2024. 1. 2. - 오후 4:24:18
 *@subject
 *@content
 */
public class Ex10 {

	public static void main(String[] args) {
	
		// 정수 10  => 0000 1010
		// 음수 -10 => ??
		// [음수 표현방법 : 2의 보수법]
		// -10 
		// 1) 절대치 :-10:  10
		// 2) 2진수           0000 1010
		// 3) 보수             1111 0101
		// 4) +1              0000 0001
		//                      1111 0110
		
		// 어떤 음수값 2진수 : 1010 0001  (-95)
		
		// [실수 진법 변환]
		/*
		 * 0.625 (10진수 실수) -> 2진수 실수
		 * 0.625X2 = [1].25
		 * 0.25X2 = [0].5
		 * 0.5X2 = [1].0
		 * 
		 * 0.[1][0][1] -> 0.101 2진수 실수 값
		 * 
		 * 0.101(2)
		 * 
		 *  1X2^-1 + 0X2^-2 + 1X2^-3 = 0.625(10)
		 */
	
		
		
		
		

	} //main

} //class
